БИТУправление_медицинским_центром_демо/src/InformationRegisters/РецептыДокументовПродаж/РецептыДокументовПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РецептыДокументовПродаж</name>
  <resources>
    <name>НомерРецепта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРецепта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерияРецепта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторМестаДеятельности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентЛьготы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.ОказаниеУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/СубъектыОбращенияМДЛП/СубъектыОбращенияМДЛП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СубъектыОбращенияМДЛП</name>
  <resources>
    <name>ИдентификаторСубъектаОбращения</name>
    <type>
      <types>DefinedType.ИдентификаторСубъектаОбращенияМДЛП</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторОрганизации</name>
    <type>
      <types>DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ОрганизацииМДЛП</types>
    </type>
  </resources>
  <resources>
    <name>МестоДеятельности</name>
    <type>
      <types>CatalogRef.МестаДеятельностиМДЛП</types>
    </type>
  </resources>
  <attributes>
    <name>СобственнаяОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОбратноеАкцептование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияКонтрагент</name>
    <type>
      <types>DefinedType.ОрганизацияКонтрагентМДЛП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМестаДеятельности</name>
    <type>
      <types>DefinedType.ОбъектМестаДеятельностиМДЛП</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/РецептыДокументовПродаж/ManagerModule.bsl
Функция ПолучитьМестоДеятельностиМДЛП(Филиал, Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СубъектыОбращенияМДЛП.МестоДеятельности.Идентификатор КАК МестоДеятельностиИдентификатор
		|ИЗ
		|	РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
		|ГДЕ
		|	СубъектыОбращенияМДЛП.ОрганизацияКонтрагент = &Филиал
		|	И СубъектыОбращенияМДЛП.ОбъектМестаДеятельности = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МестоДеятельностиИдентификатор;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
